test/tsung/send_sms.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/tsung-1.5.1/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="30000"/>
  </clients>

  <servers>
    <server host="127.0.0.1" port="8088" type="tcp"></server>
  </servers>

  <load>
<!-- 1 user each 0.1 sec == 10 users/sec for 2 minutes
    <arrivalphase phase="1" duration="2" unit="minute">
      <users interarrival="0.1" unit="second"></users>
    </arrivalphase>
-->

    <arrivalphase phase="2" duration="10" unit="minute">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>
    <session name="HTTP_SendSms" probability="50" type="ts_http">

      <request tag="get">
        <http url="/bmsgw/soap/messenger.asmx/HTTP_SendSms?customerID=10003&amp;userName=user&amp;userPassword=password&amp;originator=SMS&amp;smsText=Hello&amp;recipientPhone=375296543210&amp;messageType=Latin"
              method="GET" version="1.1">
        </http>
      </request>

      <request tag="post">
        <http url="/bmsgw/soap/messenger.asmx/HTTP_SendSms"
              method="POST" version="1.1"
              contents='customerID=10003&amp;userName=user&amp;userPassword=password&amp;originator=SMS&amp;smsText=Hello&amp;recipientPhone=375296543210&amp;messageType=Latin'>
        </http>
      </request>

      <request tag="soap11">
        <http url="/bmsgw/soap/messenger.asmx"
              method="POST" version="1.1"
              contents_from_file='contents/http_send_sms.soap11.xml'>
          <http_header name="SOAPAction" value="http://pmmsoapmessenger.com/HTTP_SendSms"/>
          <http_header name="Content-Type" value="text/xml; charset=utf-8"/>
        </http>
      </request>

      <request tag="soap12">
        <http url="/bmsgw/soap/messenger.asmx"
              method="POST" version="1.1"
              contents_from_file='contents/http_send_sms.soap12.xml'>
          <http_header name="Content-Type" value="application/soap+xml; charset=utf-8"/>
        </http>
      </request>

    </session>

    <session name="SendSms" probability="50" type="ts_http">

      <request tag="soap11">
        <match do="continue" when="match">OK</match>
        <http url="/bmsgw/soap/messenger.asmx"
              method="POST" version="1.1"
              contents_from_file='contents/send_sms.soap11.xml'>
          <http_header name="SOAPAction" value="http://pmmsoapmessenger.com/SendSms"/>
          <http_header name="Content-Type" value="text/xml; charset=utf-8"/>
        </http>

      </request>

      <request tag="soap12">
        <match do="continue" when="match">OK</match>
        <http url="/bmsgw/soap/messenger.asmx"
              method="POST" version="1.1"
              contents_from_file='contents/send_sms.soap12.xml'>
          <http_header name="Content-Type" value="application/soap+xml; charset=utf-8"/>
        </http>
      </request>

    </session>

  </sessions>
</tsung>